[
    {
        "conversation_id": "2f00f349-8feb-4c78-9c7b-93b36983d818",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую, але наразі мені це не цікаво."
            },
            {
                "role": "sales_bot",
                "message": "А що саме не підходить? Можливо, діти навантажені іншими гуртками? Уроки «Соробан» займають небагато часу, але дуже ефективні для розвитку швидкого мислення та уваги."
            },
            {
                "role": "client",
                "message": "Я розумію переваги цих уроків, але в мене немає дітей, тому це не актуально для мене. Дякую за пропозицію!"
            }
        ]
    },
    {
        "conversation_id": "73152ed3-58fa-455b-aaad-fc0f29e1e2be",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Дякую за пропозицію, але моїм дітям вже 13 і 10 років, тому, мабуть, це не зовсім те, що нам потрібно."
            },
            {
                "role": "sales_bot",
                "message": "Дякую за відповідь! Для вашої 10-річної дитини методика «Соробан» може бути дуже корисною. Вона розвиває швидке мислення, пам’ять і увагу, і займає небагато часу. Можливо, вас зацікавить пробний урок для неї?"
            },
            {
                "role": "client",
                "message": "Дякую за інформацію, але наразі це не те, що нас цікавить."
            }
        ]
    },
    {
        "conversation_id": "31aad4bc-bb24-461f-bbfd-b06b98b654fa",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Це звучить цікаво, але я ще не впевнена, чи це точно те, що нам потрібно. У мене четверо дітей, тож завжди шукаю щось корисне для їх розвитку. Можете розповісти трохи більше про ваші курси?"
            },
            {
                "role": "sales_bot",
                "message": "Чудово, що ви зацікавлені в розвитку своїх дітей! Методика «Соробан» допомагає розвивати швидке мислення, покращує пам’ять та увагу. Діти вчаться швидко рахувати в умі, що стає їм у пригоді не лише в математиці, а й в інших сферах. Курси побудовані так, щоб займати мінімум часу, але давати максимум користі. Уроки веселі та інтерактивні, тож діти навчаються із задоволенням.\n\nЗапрошую вас відвідати пробний урок, щоб ви могли самі побачити, як це працює. Як вам така ідея?"
            },
            {
                "role": "client",
                "message": "Дякую за інформацію! Це звучить цікаво, особливо частина про розвиток швидкого мислення та пам'яті. Пробний урок може бути гарною ідеєю, щоб побачити, чи це дійсно підходить для моїх дітей. Чи можете ви сказати, коли вони проводяться і як можна записатися?"
            },
            {
                "role": "sales_bot",
                "message": "Звісно! Пробні уроки ми проводимо кілька разів на тиждень, щоб ви могли обрати зручний для вас час. Щоб записатися, ви можете просто надати нам свої контактні дані, і ми зв'яжемося з вами для узгодження дати та часу. Це чудова можливість побачити методику в дії та відчути атмосферу наших занять. \n\nЯкщо ви готові, я можу допомогти з записом на пробний урок прямо зараз."
            },
            {
                "role": "client",
                "message": "Дякую за вашу пропозицію. Я ще трохи зважу всі варіанти, але, можливо, пізніше повернуся до цього. Зараз я досить зайнята, але обов’язково розгляну можливість запису на пробний урок, коли з’явиться час."
            }
        ]
    },
    {
        "conversation_id": "f7beff1e-e36b-41f3-8f64-ec19767811c8",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Так, можливо, мені буде цікаво дізнатися більше про ваші курси. Що саме ви пропонуєте?"
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» — це унікальний підхід, який допомагає дітям розвивати швидке мислення, пам’ять та увагу через заняття з усного рахунку. Діти вчаться рахувати швидко, що покращує їхні загальні когнітивні здібності і впевненість у своїх силах. Це може бути цікавим для дитини, оскільки заняття проводяться у формі гри, а результати помітні вже після кількох уроків.\n\nЧи хотіли б ви спробувати пробний урок, щоб дізнатися більше?"
            },
            {
                "role": "client",
                "message": "Дякую, це звучить цікаво. Скільки триває пробний урок і як він проходить?"
            },
            {
                "role": "sales_bot",
                "message": "Пробний урок триває близько 30-40 хвилин. Під час нього вашій дитині надається можливість познайомитися з методикою «Соробан», виконати кілька захопливих вправ і зрозуміти, як працює усний рахунок. Це також гарний шанс для вас побачити, як проходять наші заняття і задати будь-які питання. Чи можу я записати вас на пробний урок?"
            },
            {
                "role": "client",
                "message": "Гаразд, ви можете записати нас на пробний урок. Коли вони зазвичай проводяться?"
            },
            {
                "role": "sales_bot",
                "message": "Пробні уроки зазвичай проводяться в зручний для вас час — ми можемо обрати день і час, які підійдуть саме вам. Чи є у вас якісь побажання щодо дати та часу?"
            },
            {
                "role": "client",
                "message": "Ми можемо обрати вихідний день, наприклад, суботу. Зранку було б зручно. Чи є у вас вільний час у суботу?"
            },
            {
                "role": "sales_bot",
                "message": "Так, у нас є можливість провести пробний урок у суботу зранку. Як щодо 10:00? Це зручно для вас?"
            },
            {
                "role": "client",
                "message": "Так, 10:00 в суботу підходить. Дякую!"
            },
            {
                "role": "sales_bot",
                "message": "Чудово! Я запишу вас на пробний урок у суботу о 10:00. Якщо у вас виникнуть додаткові питання або зміни, не соромтеся звертатися. Дякую і до зустрічі на уроці!"
            },
            {
                "role": "client",
                "message": "Дякую, до зустрічі!"
            },
            {
                "role": "sales_bot",
                "message": "До зустрічі! Гарного дня!"
            },
            {
                "role": "client",
                "message": "І вам гарного дня!"
            },
            {
                "role": "sales_bot",
                "message": "Дякую!"
            },
            {
                "role": "client",
                "message": "Будь ласка!"
            }
        ]
    },
    {
        "conversation_id": "08fa99b6-44fe-4da6-81a8-9655fecc07bc",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі мене це не цікавить."
            },
            {
                "role": "sales_bot",
                "message": "Розумію, можливо, ваші діти вже зайняті іншими гуртками? Методика «Соробан» займає небагато часу і чудово розвиває швидке мислення та пам’ять. Це може бути корисним доповненням до інших занять."
            },
            {
                "role": "client",
                "message": "Дякую за інформацію, але наразі у нас вже є достатньо занять для дітей."
            }
        ]
    },
    {
        "conversation_id": "ff01a829-c637-4993-89fa-bb82cd5c513a",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі я зайнята іншими справами і не маю дітей, тому ці курси мені не надто потрібні."
            }
        ]
    },
    {
        "conversation_id": "4ed3c465-20ef-42b2-916d-ad9888c655d7",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але зараз не маю часу на щось нове."
            },
            {
                "role": "sales_bot",
                "message": "Розумію, що час — це важливо. А можливо, ваші діти навантажені іншими гуртками? Методика «Соробан» займає зовсім мало часу, але дає чудові результати у розвитку швидкого мислення та пам’яті. Можливо, варто спробувати?"
            },
            {
                "role": "client",
                "message": "Дякую, але поки що не на часі."
            }
        ]
    },
    {
        "conversation_id": "6aa2a56a-b50a-48d8-a1d2-1da988cb7420",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Дякую за пропозицію, але наразі я не маю часу. Можливо, звернусь до вас пізніше."
            },
            {
                "role": "sales_bot",
                "message": "Цілком розумію, дякую за відповідь! Можливо, зможемо зв’язатися з вами в майбутньому?"
            },
            {
                "role": "client",
                "message": "Так, звісно. Ви можете зв'язатися зі мною пізніше. Дякую за розуміння!"
            },
            {
                "role": "sales_bot",
                "message": "Чудово! Дякую вам за відкритість. Бажаю гарного дня! До побачення!"
            },
            {
                "role": "client",
                "message": "Дякую, вам також гарного дня! До побачення!"
            }
        ]
    },
    {
        "conversation_id": "df2343c1-ba23-4248-91e2-24749b8838fd",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую, але мене це не цікавить."
            },
            {
                "role": "sales_bot",
                "message": "Можливо, діти вже займаються у багатьох гуртках? Методика «Соробан» займає небагато часу, але значно покращує швидке мислення, пам’ять і увагу. Можливо, варто спробувати?"
            },
            {
                "role": "client",
                "message": "Дякую, але ми поки не шукаємо додаткових занять."
            }
        ]
    },
    {
        "conversation_id": "8255bd59-d79e-49d6-96e7-a9bfdb30cf96",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але поки моя дитина старша цієї вікової категорії, тому я не дуже зацікавлена в таких курсах. Однак, не виключаю можливості зацікавитися цим у майбутньому, якщо ситуація зміниться."
            },
            {
                "role": "sales_bot",
                "message": "Зрозуміло, дякую за відповідь. Якщо щось зміниться, буду радий допомогти. Успіхів вам та гарного дня! До побачення."
            },
            {
                "role": "client",
                "message": "Дякую, і вам гарного дня! До побачення."
            }
        ]
    }
]