[
    {
        "conversation_id": "8721c192-7ae8-40a0-85f6-0c7af89e1f25",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Так, це може бути цікаво. Розкажіть більше про ваші курси та як вони можуть бути корисними для моїх дітей."
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» – це інноваційна система усного рахунку, що поєднує традиційну японську методику з сучасними технологіями. Завдяки роботі з абакусом і устному рахунку, вона розвиває швидке мислення, пам’ять, увагу та логіку. За 12 років роботи школа випустила майже 10 000 учнів, організовує міжнародну Олімпіаду з учасниками з 8 країн та використовує сучасні онлайн-інструменти (E‑Soroban та додаток Soroboom), які дозволяють адаптувати завдання під рівень кожного учня.\n\nЧи зацікавлені ви спробувати пробний урок, щоб побачити переваги нашої методики на власні очі?"
            },
            {
                "role": "client",
                "message": "Це звучить дуже цікаво! Моїм дітям точно буде корисно розвинути швидке мислення та інші навички. Я готова спробувати пробний урок, щоб побачити, як це працює. Як можна записатися?"
            },
            {
                "role": "sales_bot",
                "message": "Чудово, тоді оформимо запис! Дякую за вибір нашого курсу. До зустрічі!"
            }
        ]
    },
    {
        "conversation_id": "6671228e-09fc-4114-901a-683130a54df5",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Так, цікаво. Розкажіть, будь ласка, більше про ваші курси."
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» – це інноваційна система усного рахунку, що поєднує традиційну японську методику з сучасними технологіями. Завдяки роботі з абакусом і устному рахунку, вона розвиває швидке мислення, пам’ять, увагу та логіку. За 12 років роботи школа випустила майже 10 000 учнів, організовує міжнародну Олімпіаду з учасниками з 8 країн та використовує сучасні онлайн-інструменти (E‑Soroban та додаток Soroboom), які дозволяють адаптувати завдання під рівень кожного учня.\n\nЧи зацікавлені ви спробувати пробний урок, щоб побачити переваги нашої методики на власні очі?"
            },
            {
                "role": "client",
                "message": "Так, я зацікавлена спробувати пробний урок. Як можна записатися?"
            },
            {
                "role": "sales_bot",
                "message": "Чудово, тоді оформимо запис! Дякую за вибір нашого курсу. До зустрічі!"
            }
        ]
    },
    {
        "conversation_id": "b25a0e61-08d0-4266-a15e-485c590ab682",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Так, мені цікаво дізнатися більше про ваші курси математики. Розкажіть, будь ласка, про умови проведення, програму та вартість."
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» – це інноваційна система усного рахунку, що поєднує традиційну японську методику з сучасними технологіями. Завдяки роботі з абакусом і устному рахунку, вона розвиває швидке мислення, пам’ять, увагу та логіку. За 12 років роботи школа випустила майже 10 000 учнів, організовує міжнародну Олімпіаду з учасниками з 8 країн та використовує сучасні онлайн-інструменти (E‑Soroban та додаток Soroboom), які дозволяють адаптувати завдання під рівень кожного учня.\n\nЦіна – це інвестиція в майбутнє, а розклад гнучкий і адаптується до ваших потреб. Чи зацікавлені ви спробувати пробний урок, щоб побачити переваги нашої методики на власні очі?"
            },
            {
                "role": "client",
                "message": "Це звучить цікаво. Мені важливо знати, як саме відбуваються заняття та як вони вплинуть на розклад моїх дітей. Чи можливо дізнатися більше про те, як організовані уроки, їх тривалість та частоту?"
            },
            {
                "role": "sales_bot",
                "message": "Заняття за методикою «Соробан» організовані так, щоб максимально адаптуватися до потреб і графіку вашої родини. Уроки можуть проходити як онлайн, так і офлайн, що дає можливість обирати найбільш зручний формат.\n\nТипово заняття тривають близько 60 хвилин і проводяться раз чи два на тиждень, залежно від вашого вибору. Ми прагнемо забезпечити гнучкість у розкладі, щоб інтеграція курсу в повсякденне життя була максимально комфортною для вас та ваших дітей.\n\nЯкщо вам потрібна додаткова інформація, я можу організувати дзвінок з нашим спеціалістом, щоб розповісти детальніше. Чи можемо ми зв’язатися з вами?"
            },
            {
                "role": "client",
                "message": "Дякую за детальну інформацію. Формат виглядає досить зручним для нас. Проте, я поки що не готова організовувати дзвінок. Можливо, я звернусь пізніше, коли з'явиться більше вільного часу."
            },
            {
                "role": "sales_bot",
                "message": "Зрозуміло, дякую за ваш інтерес. Якщо зміните думку, ми завжди раді допомогти. Успіхів і до побачення!"
            }
        ]
    },
    {
        "conversation_id": "7f4ded29-efb9-4864-944c-ce528ea0399c",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Дякую за пропозицію, але наразі я зосереджена на роботі та іншими справами. Можливо, розгляну це у майбутньому, коли матиму більше вільного часу."
            },
            {
                "role": "sales_bot",
                "message": "Зрозуміло, може, зараз не найкращий час. Чи можемо ми зв’язатися з вами пізніше, коли у вас буде більше часу?"
            },
            {
                "role": "client",
                "message": "Дякую за розуміння. Можливо, у майбутньому, але наразі не можу сказати точно, коли матиму більше вільного часу. Якщо ситуація зміниться, я сама з вами зв'яжуся. Дякую за пропозицію!"
            }
        ]
    },
    {
        "conversation_id": "c0cf066a-abd8-4db3-9f81-ada07a82d059",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Так, мені цікаво дізнатися про ваші курси математики, особливо для мого старшого, якому вже 5 років. Які теми ви охоплюєте і як проходить навчання?"
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» – це інноваційна система усного рахунку, що поєднує традиційну японську методику з сучасними технологіями. Наші курси зосереджені на розвитку швидкого мислення, пам’яті, уваги та логіки через роботу з абакусом та усний рахунок. За 12 років роботи ми випустили майже 10 000 учнів і організовуємо міжнародну Олімпіаду з учасниками з 8 країн. Ми також використовуємо сучасні онлайн-інструменти (E‑Soroban та додаток Soroboom), які дозволяють адаптувати завдання під рівень кожного учня.\n\nЧи зацікавлені ви спробувати пробний урок, щоб побачити переваги нашої методики на власні очі?"
            },
            {
                "role": "client",
                "message": "Це звучить дуже цікаво! Мені подобається, що ви використовуєте інноваційний підхід і сучасні технології. Я б хотів спробувати пробний урок для мого старшого сина, щоб побачити, як він зреагує на таку методику. Як можна записатися на пробне заняття?"
            },
            {
                "role": "sales_bot",
                "message": "Чудово, тоді оформимо запис! Дякую за вибір нашого курсу. До зустрічі!"
            }
        ]
    },
    {
        "conversation_id": "3116877f-e6db-4623-a168-633bb8c4b369",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Ні, дякую."
            },
            {
                "role": "sales_bot",
                "message": "Можливо, у вас діти вже займаються іншими гуртками чи вас турбує брак часу? Наш курс займає небагато часу, а інтерактивна форма занять робить його дуже цікавим для дітей."
            },
            {
                "role": "client",
                "message": "Моя дитина вже зайнята іншими гуртками."
            }
        ]
    },
    {
        "conversation_id": "2108b1b9-a229-4528-bd8b-e0b83a806176",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Так, мені цікаво дізнатися більше про ваші курси математики. Розкажіть, будь ласка, про програму, методику викладання та графік занять."
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» – це інноваційна система усного рахунку, що поєднує традиційну японську методику з сучасними технологіями. Завдяки роботі з абакусом і устному рахунку, вона розвиває швидке мислення, пам’ять, увагу та логіку. За 12 років роботи школа випустила майже 10 000 учнів, організовує міжнародну Олімпіаду з учасниками з 8 країн та використовує сучасні онлайн-інструменти (E‑Soroban та додаток Soroboom), які дозволяють адаптувати завдання під рівень кожного учня.\n\nНаш графік занять є гнучким і адаптується до ваших потреб. Ціна – це інвестиція в майбутнє ваших дітей.\n\nЧи зацікавлені ви спробувати пробний урок, щоб побачити переваги нашої методики на власні очі?"
            },
            {
                "role": "client",
                "message": "Звучить цікаво, особливо з огляду на розвиток швидкого мислення та логіки. Я б хотіла дізнатися більше про графік занять, щоб зрозуміти, чи підходить він моїм дітям. Чи можете ви надати більше інформації про розклад та вартість пробного уроку?"
            },
            {
                "role": "sales_bot",
                "message": "Наші заняття мають гнучкий розклад, що дозволяє адаптуватися до вашого розпорядку. Це означає, що ми можемо підібрати зручний час для ваших дітей, щоб вони могли навчатися без зайвого напруження. Щодо вартості, пробний урок надається безкоштовно, щоб ви могли оцінити методику та її переваги без ризиків.\n\nЯкщо бажаєте, я можу передати ваш запит нашому спеціалісту для детальнішої консультації. Чи можемо ми зв’язатися з вами для цього?"
            },
            {
                "role": "client",
                "message": "Звучить добре. Будь ласка, передайте мій запит вашому спеціалісту, щоб я могла отримати більше інформації та обговорити можливі варіанти розкладу занять для моїх дітей. Дякую!"
            },
            {
                "role": "sales_bot",
                "message": "Чудово, я передам ваш запит нашому спеціалісту. Чи можете ви зазначити зручний для вас час для дзвінка, щоб ми могли зв'язатися з вами для детальнішої консультації?"
            },
            {
                "role": "client",
                "message": "Мені зручно буде поспілкуватися в будні дні після 18:00. Дякую за допомогу!"
            },
            {
                "role": "sales_bot",
                "message": "Дякую за уточнення! Я передам цю інформацію нашому спеціалісту, і вони зв'яжуться з вами в будні дні після 18:00. Дякую за ваш інтерес до нашої методики, і до зустрічі!"
            }
        ]
    },
    {
        "conversation_id": "193d2020-909d-4a91-8207-0cb851baf514",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Дякую, але зараз мені це не потрібно."
            }
        ]
    },
    {
        "conversation_id": "a4183147-dcb5-4451-9bae-150bbc3cba90",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Вітаю! Моєму молодшому синові 8 років, тож курси можуть бути цікавими. Розкажіть більше про програму і чим вона відрізняється від звичайних шкільних занять?"
            },
            {
                "role": "sales_bot",
                "message": "Методика «Соробан» – це інноваційна система усного рахунку, що поєднує традиційну японську методику з сучасними технологіями. Завдяки роботі з абакусом і устному рахунку, вона розвиває швидке мислення, пам’ять, увагу та логіку. \n\nЗа 12 років роботи школа випустила майже 10 000 учнів, організовує міжнародну Олімпіаду з учасниками з 8 країн та використовує сучасні онлайн-інструменти (E-Soroban та додаток Soroboom), які дозволяють адаптувати завдання під рівень кожного учня.\n\nЧи зацікавлені ви спробувати пробний урок, щоб побачити переваги нашої методики на власні очі?"
            },
            {
                "role": "client",
                "message": "Цікаво! Пробний урок – це гарна можливість побачити, як це працює. Як можна записати сина на такий урок?"
            },
            {
                "role": "sales_bot",
                "message": "Чудово, тоді оформимо запис! Дякую за вибір нашого курсу. До зустрічі!"
            }
        ]
    },
    {
        "conversation_id": "044dcf81-7c8a-4154-afb0-e8a1ab1bccd4",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Ні, дякую."
            },
            {
                "role": "sales_bot",
                "message": "Можливо, у вас діти вже займаються іншими гуртками чи вас турбує брак часу? Наш курс займає небагато часу, а інтерактивна форма занять робить його дуже цікавим для дітей."
            },
            {
                "role": "client",
                "message": "У мене немає дітей."
            }
        ]
    }
]