[
    {
        "conversation_id": "f04b1bb3-9752-41f6-8e6d-ca71d9e75c12",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але зараз я не шукаю нових курсів для своїх дітей. Проте я обов'язково розгляну це в майбутньому, коли у мене буде більше часу та ресурсів."
            },
            {
                "role": "sales_bot",
                "message": "Зрозуміло, дякую за вашу відповідь! Якщо ви вирішите повернутися до цього питання, буду радий допомогти. Бажаю вам успіхів і гарного дня! До побачення."
            },
            {
                "role": "client",
                "message": "Дякую! Бажаю вам також гарного дня. До побачення!"
            }
        ]
    },
    {
        "conversation_id": "84811d48-adfc-4766-b4b3-8342ba9d4c59",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі мене це не цікавить."
            },
            {
                "role": "sales_bot",
                "message": "А що саме не підходить? Можливо, ваші діти навантажені іншими гуртками? Методика «Соробан» займає небагато часу й допомагає покращити швидке мислення, пам’ять та увагу. Це може стати корисним доповненням до їхніх занять."
            },
            {
                "role": "client",
                "message": "Дякую за інформацію, але я наразі не шукаю додаткових занять для своєї дитини. Мені важливо, щоб вона мала час для відпочинку та вільної гри."
            }
        ]
    },
    {
        "conversation_id": "31c99dd6-c2c5-471b-b748-90359c84a464",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але зараз я не зацікавлена."
            },
            {
                "role": "sales_bot",
                "message": "Розумію. Можливо, діти зайняті іншими гуртками? Методика «Соробан» займає мало часу, але значно розвиває швидке мислення, пам’ять та увагу. Можливо, варто спробувати?"
            },
            {
                "role": "client",
                "message": "Звучить цікаво, але, на жаль, зараз ми не маємо можливості додати ще один гурток до нашого розкладу. Дякую за розуміння."
            }
        ]
    },
    {
        "conversation_id": "c34fcd30-3ff1-4f04-a2c9-eed02288f7c8",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі ми не плануємо додаткових занять для молодших дітей. Бажаю вам успіху!"
            }
        ]
    },
    {
        "conversation_id": "a010acc8-5bf8-47af-9ae1-ca1dffffbc49",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі мене це не цікавить. У мене вже є доволі багато справ і обов'язків, тож я не шукаю додаткових занять для своїх дітей. Але дякую, що звернулися!"
            },
            {
                "role": "sales_bot",
                "message": "Розумію, що ви зайняті. Можливо, наш курс «Соробан» міг би допомогти вашим дітям краще організувати свій час та підвищити концентрацію. Заняття займають небагато часу, і це може бути корисним доповненням до їхнього розвитку. Чи є щось конкретне, що вас турбує?"
            },
            {
                "role": "client",
                "message": "Дякую за інформацію, але наразі мене це не цікавить. Я намагаюся зосередитися на інших речах і не хочу додавати до нашого графіку нові заняття. Але дякую за вашу увагу!"
            }
        ]
    },
    {
        "conversation_id": "6da0c644-6e84-47df-9681-b631dce4ec44",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі у нас немає часу на додаткові заняття. Зважаючи на мою зайнятість, я не зацікавлена в цьому."
            },
            {
                "role": "sales_bot",
                "message": "Розумію, можливо, діти вже мають багато інших занять. Міні-уроки «Соробан» займають небагато часу, але дуже ефективні для розвитку швидкого мислення та уваги. Можливо, спробуєте пробний урок, щоб переконатися?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але на даний момент ми не плануємо додавати нові заняття."
            }
        ]
    },
    {
        "conversation_id": "b67de370-33ab-4fdf-8899-fb3747dbe834",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але на даний момент у мене є інші пріоритети."
            },
            {
                "role": "sales_bot",
                "message": "Розумію, можливо, діти вже мають інші заняття чи гуртки? Методика «Соробан» займає небагато часу, але значно покращує швидкість мислення, пам’ять і увагу. Можливо, це могло б доповнити їхні заняття?"
            },
            {
                "role": "client",
                "message": "Звучить цікаво, але зараз ми зосереджені на інших сферах. Дякую за інформацію!"
            }
        ]
    },
    {
        "conversation_id": "a5a2024f-a26f-4bbc-9059-bfa6ef240378",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую, але мої діти зараз досить зайняті, щоб відвідувати додаткові заняття. Бажаю вам успіху з курсами!"
            },
            {
                "role": "sales_bot",
                "message": "А можливо, у вас є якісь інші бажання або вимоги до додаткових занять? Наші уроки займають небагато часу і можуть стати цікавим доповненням до інших занять. Але якщо ні, то я розумію."
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але наразі це не те, що нас цікавить. Успіхів вам!"
            }
        ]
    },
    {
        "conversation_id": "757ff917-0fa8-4256-81dc-28dc421a7e07",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Привіт! Дякую за пропозицію, але наразі я не зацікавлена."
            },
            {
                "role": "sales_bot",
                "message": "Зрозуміло. А може, діти зайняті іншими гуртками? Методика «Соробан» займає небагато часу, але розвиває швидке мислення, пам’ять і увагу, що може бути корисним у навчанні. Чи можемо ми розглянути можливість на майбутнє?"
            },
            {
                "role": "client",
                "message": "Дякую за інформацію, але на цей момент я не планую записувати дітей на нові гуртки. Якщо мої плани зміняться, я обов'язково розгляну вашу пропозицію."
            }
        ]
    },
    {
        "conversation_id": "6bf1364a-1884-46a8-9c74-9153f4ea14e4",
        "dialogue": [
            {
                "role": "sales_bot",
                "message": "Вітаю! Чи цікаво дізнатися про наші курси математики для дітей 5–12 років?"
            },
            {
                "role": "client",
                "message": "Дякую за пропозицію, але мені це не цікаво. У мене немає дітей, тож ці курси мені не потрібні."
            }
        ]
    }
]